yii3.0/frontend/models/Account.php

SELECT * FROM `wc_account` WHERE (`id`=15) AND (`user_id`='14')
---
    public  function  getOne($id,$uid)
    {
        return $this->find()->where(['id'=>$id])->andWhere(['user_id'=>$uid])->asArray()->one();

SELECT * FROM `wc_account` WHERE `user_id`='14'
---
     public  function  getAll($id)
     {
         return $this->find()->where(['user_id'=>$id])->asArray()->all();

DELETE FROM `wc_account` WHERE `id`=16
---
     public  function  deleteOne($id)
     {
         return $this->deleteAll(['id'=>$id]);

SELECT COUNT(*) FROM `wc_account` WHERE `user_id`='14'
---
     public  function  getCount($id)
     {
         return Account::find()->where(['user_id'=>$id])->count();