yii3.0/frontend/models/WcUser.php

    public function login($where, $user, $pwd)
    {
        return $this->find()->where(" $where = :user",[':user'=>$user])->andWhere("password = :pwd",[':pwd'=>$pwd])->asArray()->one();
---
SELECT * FROM `wc_user` WHERE ( username = 'admin') AND (password = '1096519509759695686')

    public function loginDO($data, $id)
    {
        return $this->updateAll($data,['id'=> $id]);
---
UPDATE `wc_user` SET `end_ip`='127.0.0.1', `end_time`=1496287656 WHERE `id`='1'

    public function getOne($id)
    {
        return $this->find()->where(['id'=>$id])->asArray()->one();
---
SELECT * FROM `wc_user` WHERE `id`='admin'

    public function login_sel($username)
    {
        return $this->find()->where(['username'=>$username])->asArray()->one();
---
SELECT * FROM `wc_user` WHERE `username`='admin'