yii3.0/frontend/models/WcUserGroupPermission.php

SELECT * FROM `wc_user_group_permission` WHERE `gid` IS NULL
---
    public function getAll($id)
    {
        return $this->find()->where(['gid'=>$id])->asArray()->all();