yii3.0/frontend/controllers/PlatformController.php

    public function actionIndex()
    {
        $session = yii::$app->session['user'];

        $WcUserapi = new WcUserapi();
        $arrayInfo = $WcUserapi->find()
            ->select('keywords,id,reply_rule')
            ->where(['wx_id' => $session['id']])
            ->asArray()
            ->all();
---
SELECT `keywords`, `id`, `reply_rule` FROM `wc_userapi` WHERE `wx_id`='1'